src/Documents/инкКадровыйПеревод/инкКадровыйПеревод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкКадровыйПеревод</name>
  <registerRecords>InformationRegister.инкРеестрКадровыхДокументов</registerRecords>
  <registerRecords>InformationRegister.инкКадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>ВидПеревода</name>
    <type>
      <types>EnumRef.инкВидПеревода</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабочейНедели</name>
    <type>
      <types>EnumRef.инкВидРабочейНедели</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.инкДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.инкОснованияДляКадровыхПриказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПеревода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/инкКадровыйПеревод/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ИндивидуальныйКоэффициент = 0 Тогда
		ЭтотОбъект.ИндивидуальныйКоэффициент = 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИсториюКадровыхДанныхПоСотруднику() Экспорт

	Если ЗначениеЗаполнено(ЭтотОбъект.ДатаПриказа) Тогда
		МоментВремени = НачалоДня(ЭтотОбъект.ДатаПриказа)-1;
	Иначе
		МоментВремени = ТекущаяДата();
	КонецЕсли;	
	
	ДанныеПоСотруднику = инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ЭтотОбъект.Сотрудник,МоментВремени); 
	
	Возврат ДанныеПоСотруднику;	
	
КонецФункции

#Область о // Печать:

Функция СформироватьТабличныйДокументТ5() Экспорт
	
	Т5ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьОбщийМакет("ПФ_MXL_Т5"); 
	
	ОбластьОтчет = Макет.ПолучитьОбласть("Шапка");
	ОбластьОтчет.Параметры.СсылкаНаОбъектОрганизацияНаименованиеСокращенное	= Организация.Наименование;
	ОбластьОтчет.Параметры.СсылкаНаОбъектОрганизацияКодПоОКПО = Организация.ОКПО;
	ОбластьОтчет.Параметры.СсылкаНаОбъектНомерНаПечать = Номер;
	ОбластьОтчет.Параметры.СсылкаНаОбъектДата = Дата;
	Т5ТабличныйДокумент.Вывести(ОбластьОтчет); 
	
	ОбластьОтчет = Макет.ПолучитьОбласть("Работник");
	ОбластьОтчет.Параметры.РаботаДатаНачалаПеревода = ДатаПриказа;
	ОбластьОтчет.Параметры.РаботаСотрудникТабельныйНомерНаПечать = Сотрудник.ТабельныйНомер;
	ОбластьОтчет.Параметры.ЛичныеДанныеФИОФамилияИмяОтчествоВВинительномПадеже = Сотрудник.ФИО;
	ОбластьОтчет.Параметры.РаботаВидПеревода = ВидПеревода;
	
	ИсторияКадровыхДанных = ПолучитьИсториюКадровыхДанныхПоСотруднику();
	
	ОбластьОтчет.Параметры.РаботаПодразделениеПрежнееНаПечать = ИсторияКадровыхДанных.Подразделение;
	ОбластьОтчет.Параметры.РаботаДолжностьПрежняя = ИсторияКадровыхДанных.Должность;
	ОбластьОтчет.Параметры.РаботаРазрядКатегорияПрежниеНаПечать = "";
	ОбластьОтчет.Параметры.РаботаПричинаПеревода = ПричинаПеревода;
	ОбластьОтчет.Параметры.РаботаДистанционнаяРаботаНаПечать = "";
	ОбластьОтчет.Параметры.РаботаПодразделениеНаПечать = Подразделение;
	ОбластьОтчет.Параметры.РаботаДолжность = Должность;
	ОбластьОтчет.Параметры.РаботаРазрядКатегорияНаПечать = "";
	ОбластьОтчет.Параметры.РаботаСведенияОбОплатеТрудаТарифнаяСтавкаНаПечать = Оклад;
	ОбластьОтчет.Параметры.РаботаСведенияОбОплатеТрудаНадбавкаНаПечать = Оклад * РайонныйКоэффициент
	                                                                   + Оклад * СевернаяНадбавка;
	ОбластьОтчет.Параметры.РаботаТрудовойДоговорДатаОформленияНаПечать = ТекущаяДата();
	ОбластьОтчет.Параметры.РаботаТрудовойДоговорНомер = "";
	ОбластьОтчет.Параметры.РаботаОснованиеПеревода = Основание;
	Т5ТабличныйДокумент.Вывести(ОбластьОтчет); 
	
	РуководительДанные = Справочники.инкОрганизации.КадровыеДанныеРуководителя(Организация);
	ОбластьОтчет = Макет.ПолучитьОбласть("Подвал");
	ОбластьОтчет.Параметры.СсылкаНаОбъектДолжностьРуководителя = РуководительДанные.Должность;
	ОбластьОтчет.Параметры.СсылкаНаОбъектРуководительРасшифровкаПодписи	= РуководительДанные.ФИОСокращенное;
	ОбластьОтчет.Параметры.СсылкаНаОбъектДатаОзнакомленияРаботника = инкОтчетыСервер.ПолучитьШаблонДляЗаполненияДатыОзнакомления();
	Т5ТабличныйДокумент.Вывести(ОбластьОтчет); 
	
	Возврат Т5ТабличныйДокумент;
	
КонецФункции      

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
